УТ_для_edt/src/Catalogs/МаркетинговыеМероприятия/МаркетинговыеМероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МаркетинговыеМероприятия</name>
  <comment>Произвольные комментарии к мероприятию</comment>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СегментПартнеров</name>
    <type>
      <types>CatalogRef.СегментыПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Аудитория</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Важность</name>
    <comment>Важность</comment>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВидКампании</name>
    <type>
      <types>CatalogRef.CRM_ВидыМаркетинговыхКампаний</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДатаАктуальности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПериодАктуальности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПланируемоеКоличествоИнтересов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПлановаяСуммаЗатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПлановаяСуммаПродаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Регион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ФактическаяСуммаЗатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_UTMМетка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВедетсяВидеофиксация</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчетнаяЗаписьСервисаРаспознавания</name>
    <type>
      <types>CatalogRef.CRM_УчетныеЗаписиСервисаИдентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИнфоНадписьПервоеПосещениеНовыйКлиент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИнфоНадписьНеПервоеПосещениеНовыйКлиент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИнфоНадписьПервоеПосещениеНеНовыйКлиент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИнфоНадписьНеПервоеПосещениеНеНовыйКлиент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникПолученияЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>CatalogRef.CRM_ИсточникиПолученияЛидов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СквознаяАналитика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Неограниченно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПартнера</name>
      <type>
        <types>CatalogRef.РолиПартнеровВСделкахИПроектах</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_СвоиУчастники</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ПомещенияВидеофиксации</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.CRM_Помещения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_КамерыВидеофиксации</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.CRM_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Камера</name>
      <type>
        <types>CatalogRef.CRM_Камеры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеКамеры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/CRM_АктивныеСеансыВидеофиксации/CRM_АктивныеСеансыВидеофиксации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_АктивныеСеансыВидеофиксации</name>
  <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СеансЗапущен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АктивноеМероприятие</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>СервисИдентификации</name>
    <type>
      <types>CatalogRef.CRM_УчетныеЗаписиСервисаИдентификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ЗатратыРекламныхКампаний/CRM_ЗатратыРекламныхКампаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЗатратыРекламныхКампаний</name>
  <resources>
    <name>Показы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Клики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СредняяЦенаКлика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникиКампаний</name>
    <type>
      <types>CatalogRef.CRM_ИсточникиРекламныхКампаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СценарийАналитики</name>
    <type>
      <types>EnumRef.CRM_СценарииПолученияАналитики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CRM_РекламнаяКампания</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъявленияРекламныхКампаний</name>
    <type>
      <types>CatalogRef.CRM_ОбъявленияРекламныхКампаний</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/CRM_ТочкиМаршрутов/CRM_ТочкиМаршрутов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ТочкиМаршрутов</name>
  <owners>Catalog.CRM_КартыМаршрутов</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.CRM_ВидыТочекМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Групповая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВложенныйПроцесс</name>
    <type>
      <types>CatalogRef.CRM_КартыМаршрутов</types>
    </type>
  </attributes>
  <attributes>
    <name>Пояснение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <comment>Порядковый номер точки в карте маршрута</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗавершения</name>
    <type>
      <types>CatalogRef.CRM_ВариантыЗавершенияБизнесПроцесса</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВходящиеТочки</name>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.CRM_ТочкиМаршрутов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВерсии</name>
      <comment>Номер данной версии</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсходящиеТочки</name>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.CRM_ТочкиМаршрутов</types>
      </type>
    </attributes>
    <attributes>
      <name>Индекс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантСиноним</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВерсии</name>
      <comment>Номер данной версии</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбработчикиСобытий</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.CRM_ОбработчикиСобытийТочекМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработчик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТочкиРазделенияСлияния</name>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.CRM_ТочкиМаршрутов</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>EnumRef.CRM_ВидыТочекМаршрута</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВерсии</name>
      <comment>Номер данной версии</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВетки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/МаркетинговыеМероприятия/Forms/CRM_ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Создать взаимодействие по выбранному контакту.
Процедура СоздатьВзаимодействие(ИмяФормы)
	
	Основание = Новый Структура();
	Основание.Вставить("Предмет", Объект.Ссылка);
	Основание.Вставить("Контакт",
	?(ЗначениеЗаполнено(Элементы.ПартнерыИКонтактныеЛица.ТекущиеДанные.КонтактноеЛицо),
	Элементы.ПартнерыИКонтактныеЛица.ТекущиеДанные.КонтактноеЛицо,
	Элементы.ПартнерыИКонтактныеЛица.ТекущиеДанные.Партнер));
	ОткрытьФорму(ИмяФормы, Новый Структура("Основание", Основание),,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВалютыДокумента()
	
	Элементы.Валюта.Подсказка = НСтр("ru='Курс: ';en='Rate: '") + Формат(Объект.CRM_Курс,"ЧДЦ=4; ЧН=0,0000") + НСтр("ru=', крат.: '") + Объект.CRM_Кратность;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКурсИКратностьВалюты(Валюта, ДатаКурса)
	
	Возврат РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса,Новый Структура("Валюта", Валюта));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступностьФормы(Форма)
	
	Форма.Элементы.ФормаОбщаяКомандаCRM_СоздатьЛичнуюЗадачу.Доступность = НЕ ЗначениеЗаполнено(Форма._ЛичнаяЗадача);
	Форма.Элементы.ДатаАктуальности.Видимость = ?(ЗначениеЗаполнено(Форма.Объект.CRM_ПериодАктуальности),Истина,Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуГиперссылок()
	
	ТекстКоманда = Команды.Найти("_ВыполнитьЗадачу");
	Если ТекстКоманда = Неопределено Тогда
		НоваяКомандаФормы = Команды.Добавить("_ВыполнитьЗадачу");
		НоваяКомандаФормы.Заголовок					= "Выполнить";
		НоваяКомандаФормы.Подсказка					= "Отметить задачу как выполненную";
		НоваяКомандаФормы.Действие					= "Подключаемый_ВыполнитьЗадачу";
		//НоваяКомандаФормы.ИзменяетСохраняемыеДанные	= Истина;
	КонецЕсли;
	
	МассивДобавляемыхРеквизитов = Новый Массив();
	
	Попытка
		ЭтотОбъект["_ЛичнаяЗадача"] = Задачи.ЗадачаИсполнителя.ПустаяСсылка();
		ЭтотОбъект["_ЛичнаяЗадачаСтрокой"] = "";
	Исключение
		ОписаниеТиповЗадача = Новый ОписаниеТипов("ЗадачаСсылка.ЗадачаИсполнителя");
		НовыйРеквизит = Новый РеквизитФормы("_ЛичнаяЗадача", ОписаниеТиповЗадача);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		ОписаниеТиповЗадача = Новый ОписаниеТипов("Строка");
		НовыйРеквизит = Новый РеквизитФормы("_ЛичнаяЗадачаСтрокой", ОписаниеТиповЗадача);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	КонецПопытки;
	
	Попытка
		ЭтотОбъект["_БизнесПроцесс"] = БизнесПроцессы.CRM_БизнесПроцесс.ПустаяСсылка();
		ЭтотОбъект["_БизнесПроцессСтрокой"] = "";
	Исключение
		ОписаниеТиповЗадача = Новый ОписаниеТипов("БизнесПроцессСсылка.CRM_БизнесПроцесс");
		НовыйРеквизит = Новый РеквизитФормы("_БизнесПроцесс", ОписаниеТиповЗадача);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		ОписаниеТиповЗадача = Новый ОписаниеТипов("Строка");
		НовыйРеквизит = Новый РеквизитФормы("_БизнесПроцессСтрокой", ОписаниеТиповЗадача);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	КонецПопытки;
	
	Если МассивДобавляемыхРеквизитов.Количество() > 0 Тогда
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗадачаИсполнителя.Ссылка КАК Ссылка,
	|	0 КАК ВидСсылки
	|ПОМЕСТИТЬ ЛичныеЗадачи
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	(НЕ ЗадачаИсполнителя.ПометкаУдаления)
	|	И ЗадачаИсполнителя.CRM_Личная
	|	И (НЕ ЗадачаИсполнителя.Выполнена)
	|	И ЗадачаИсполнителя.Предмет = &Предмет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	Если ЗначениеЗаполнено(Объект.CRM_Проект) И ЗначениеЗаполнено(Объект.CRM_Проект.CRM_КартаМаршрута) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	CRM_БизнесПроцесс.Ссылка КАК Ссылка,
		|	1 КАК ВидСсылки
		|ПОМЕСТИТЬ БизнесПроцессы
		|ИЗ
		|	БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
		|ГДЕ
		|	(НЕ CRM_БизнесПроцесс.ПометкаУдаления)
		|	И CRM_БизнесПроцесс.КартаМаршрута = &КартаМаршрута
		|	И CRM_БизнесПроцесс.Предмет = &Предмет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ЛичныеЗадачи.Ссылка,
	|	ЛичныеЗадачи.ВидСсылки
	|ИЗ
	|	ЛичныеЗадачи КАК ЛичныеЗадачи";
	Если ЗначениеЗаполнено(Объект.CRM_Проект) И ЗначениеЗаполнено(Объект.CRM_Проект.CRM_КартаМаршрута) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БизнесПроцессы.Ссылка,
		|	БизнесПроцессы.ВидСсылки
		|ИЗ
		|	БизнесПроцессы КАК БизнесПроцессы";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Предмет",Объект.Ссылка);
	Если ЗначениеЗаполнено(Объект.CRM_Проект) И ЗначениеЗаполнено(Объект.CRM_Проект.CRM_КартаМаршрута) Тогда
		Запрос.УстановитьПараметр("КартаМаршрута", Объект.CRM_Проект.CRM_КартаМаршрута);
	КонецЕсли;
	
	ТаблицаОбъектов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаб Из ТаблицаОбъектов Цикл
		Если СтрокаТаб.ВидСсылки = 0 Тогда
			ЭтотОбъект._ЛичнаяЗадача			= СтрокаТаб.Ссылка;
			ЭтотОбъект._ЛичнаяЗадачаСтрокой	= Строка(СтрокаТаб.Ссылка);
		КонецЕсли;
		
		Если СтрокаТаб.ВидСсылки = 1 Тогда
			ЭтотОбъект._БизнесПроцесс			= СтрокаТаб.Ссылка;
			ЭтотОбъект._БизнесПроцессСтрокой	= CRM_БизнесПроцессыСервер.СформироватьПредставлениеБизнесПроцесса(СтрокаТаб.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	// Отрисуем гиперссылки
	// Гирепссылка на бизнес-процесс.
	Если НЕ Элементы.Найти("_БизнесПроцессСтрокой") = Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект._БизнесПроцесс) Тогда
			Элементы.Удалить(Элементы["_БизнесПроцессЗаголовок"]);
			Элементы.Удалить(Элементы["_БизнесПроцессСтрокой"]);
		Иначе
			Элементы["_БизнесПроцессСтрокой"].Заголовок	= СокрЛП(ЭтотОбъект._БизнесПроцессСтрокой);
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ЭтотОбъект._БизнесПроцесс) Тогда
			
			НовыйЭлемент = Элементы.Добавить("_БизнесПроцессЗаголовок", Тип("ДекорацияФормы"), Элементы.ГиперссылкаЗаголовок);
			НовыйЭлемент.Вид		= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок	= "Бизнес-процесс: ";
			
			НовыйЭлемент = Элементы.Добавить("_БизнесПроцессСтрокой", Тип("ДекорацияФормы"), Элементы.ГиперссылкаЗначение);
			НовыйЭлемент.Заголовок	= СокрЛП(ЭтотОбъект._БизнесПроцессСтрокой);
			НовыйЭлемент.Вид		= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Гиперссылка= Истина;
			НовыйЭлемент.УстановитьДействие("Нажатие",	"Подключаемый_ГиперссылкаНажатие");
			
		КонецЕсли;
	КонецЕсли;
	
	// Гирепссылка на Задачу
	Если НЕ Элементы.Найти("_ЛичнаяЗадачаСтрокой") = Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект._ЛичнаяЗадача) Тогда
			Элементы.Удалить(Элементы["_ЛичнаяЗадачаЗаголовок"]);
			Элементы.Удалить(Элементы["_ЛичнаяЗадачаСтрокой"]);
			Элементы.Удалить(Элементы["Кнопка_ВыполнитьЗадачу"]);
		КонецЕсли;
	Иначе
		
		Если ЗначениеЗаполнено(ЭтотОбъект._ЛичнаяЗадача) Тогда
			
			ЭлементПеред = Элементы.Найти("_БизнесПроцессЗаголовок");
			Если НЕ ЭлементПеред = Неопределено Тогда
				НовыйЭлемент = Элементы.Вставить("_ЛичнаяЗадачаЗаголовок", Тип("ДекорацияФормы"), Элементы.ГиперссылкаЗаголовок, ЭлементПеред);
			Иначе
				НовыйЭлемент = Элементы.Добавить("_ЛичнаяЗадачаЗаголовок", Тип("ДекорацияФормы"), Элементы.ГиперссылкаЗаголовок);
			КонецЕсли;
			НовыйЭлемент.Вид		= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок	= "Задача: ";
			
			НовыйЭлемент = Элементы.Добавить("_ЛичнаяЗадачаСтрокой", Тип("ДекорацияФормы"), Элементы.ЗначениеГиперСсылкиЗадача);
			НовыйЭлемент.Заголовок	= СокрЛП(ЭтотОбъект._ЛичнаяЗадача);
			НовыйЭлемент.Вид		= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Гиперссылка= Истина;
			НовыйЭлемент.УстановитьДействие("Нажатие",	"Подключаемый_ГиперссылкаНажатие");
			
			НовыйЭлемент = Элементы.Добавить("Кнопка_ВыполнитьЗадачу",Тип("КнопкаФормы"), Элементы.ЗначениеГиперСсылкиЗадача);
			НовыйЭлемент.ИмяКоманды			= "_ВыполнитьЗадачу";
			НовыйЭлемент.Заголовок			= "Выполнить";
			НовыйЭлемент.Картинка			= БиблиотекаКартинок.ВыполнитьЗадачу;
			НовыйЭлемент.Отображение		= ОтображениеКнопки.КартинкаИТекст;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьДубликатБизнесПроцесса(Предмет)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	CRM_БизнесПроцесс.Ссылка КАК Ссылка
	|ИЗ
	|	БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
	|ГДЕ
	|	НЕ CRM_БизнесПроцесс.ПометкаУдаления
	|	И НЕ CRM_БизнесПроцесс.Завершен
	|	И CRM_БизнесПроцесс.Предмет = &Предмет");
	Запрос.УстановитьПараметр("Предмет", Предмет);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Процедура ДобавитьУдалитьКомандуСозданияБизнесПроцесса()
	
	Если ИспользоватьБизнесПроцессы И ЗначениеЗаполнено(Объект.CRM_Проект) И ЗначениеЗаполнено(Объект.CRM_Проект.CRM_КартаМаршрута) Тогда
		CRM_БизнесПроцессыСервер.ДобавитьУдалитьКомандуСозданияБизнесПроцессаНаКоманднуюПанель(ЭтотОбъект, Элементы.ГруппаКнопокСоздать, Объект.CRM_Проект.CRM_КартаМаршрута, Ложь);
	Иначе
		CRM_БизнесПроцессыСервер.ДобавитьУдалитьКомандуСозданияБизнесПроцессаНаКоманднуюПанель(ЭтотОбъект,,, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодДатыАктуальности()
	
	Если ЗначениеЗаполнено(Объект.CRM_ПериодАктуальности) Тогда
		Объект.CRM_ДатаАктуальности = Объект.ДатаНачала + (Объект.CRM_ПериодАктуальности*86400);
	Иначе
		Объект.CRM_ДатаАктуальности = Объект.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтображениеДатыАктуальности()
	
	Если ЗначениеЗаполнено(Объект.CRM_ДатаАктуальности) И (Объект.CRM_ДатаАктуальности>Объект.ДатаОкончания) Тогда
		
		пЗаголовок = НСтр("ru='дней ';en='days '") + НСтр("ru='( до '") + Формат(Объект.CRM_ДатаАктуальности,"ДЛФ=DD")+")";
		Элементы.ДатаАктуальности.Заголовок = пЗаголовок;
		Элементы.ДатаАктуальности.Видимость = Истина;
		
	Иначе
		
		Элементы.ДатаАктуальности.Видимость = Истина;
		Элементы.ДатаАктуальности.Заголовок = НСтр("ru='дней ';en='days '");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ВернутьЗаголовокКоманды(ИмяКоманды)
	
	Возврат Команды[ИмяКоманды].Заголовок;
	
КонецФункции

&НаКлиенте
Процедура ПодборУчастников()
	МассивУчастников = Новый Массив();
	Для Каждого СтрокаТаблицы Из Объект.CRM_СвоиУчастники Цикл
		Если	ЗначениеЗаполнено(СтрокаТаблицы.Участник)
			И	ТипЗнч(СтрокаТаблицы.Участник) = Тип("СправочникСсылка.Пользователи")
			И	ЗначениеЗаполнено(СтрокаТаблицы.ДатаНачала)
			И	ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) Тогда
			//
			МассивУчастников.Добавить(Новый Структура("Пользователь,НачалоПериода,ОкончаниеПериода", СтрокаТаблицы.Участник, СтрокаТаблицы.ДатаНачала, СтрокаТаблицы.ДатаОкончания));
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыСтруктура = Новый Структура();
	ПараметрыСтруктура.Вставить("Пользователи",		МассивУчастников);
	ПараметрыСтруктура.Вставить("ПериодНачало",		Объект.ДатаНачала);
	ПараметрыСтруктура.Вставить("ПериодОкончание",	Объект.ДатаОкончания);
	ПараметрыСтруктура.Вставить("ВыбиратьПериоды");
	ПараметрыСтруктура.Вставить("ПоказыватьТаблицуПериодов");
	ПараметрыСтруктура.Вставить("ИнтервалШкалыВремени", 60);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодборУчастниковЗавершение", ЭтотОбъект, МассивУчастников);
	ОткрытьФорму("ОбщаяФорма.CRM_ПодборПользователейПоКалендарю", ПараметрыСтруктура, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПодборУчастниковЗавершение(РезультатОткрытия, МассивУчастников) Экспорт
	Если ТипЗнч(РезультатОткрытия) = Тип("Массив") Тогда
		МинимальнаяВыбраннаяДата = Неопределено;
		МаксимальнаяВыбраннаяДата = Неопределено;
		МассивВыбранныеПользователи = Новый Массив();
		Для Каждого ДобавляемыйПользователь Из РезультатОткрытия Цикл
			МассивВыбранныеПользователи.Добавить(ДобавляемыйПользователь.Пользователь);
			
			СтруктураПоиска = Новый Структура("Участник,ДатаНачала,ДатаОкончания", ДобавляемыйПользователь.Пользователь, ДобавляемыйПользователь.НачалоПериода, ДобавляемыйПользователь.ОкончаниеПериода);
			Если Объект.CRM_СвоиУчастники.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
				НоваяСтрока = Объект.CRM_СвоиУчастники.Добавить();
				НоваяСтрока.Участник		= ДобавляемыйПользователь.Пользователь;
				НоваяСтрока.ДатаНачала		= ДобавляемыйПользователь.НачалоПериода;
				НоваяСтрока.ДатаОкончания	= ДобавляемыйПользователь.ОкончаниеПериода;
			КонецЕсли;
			Если МинимальнаяВыбраннаяДата = Неопределено Или МинимальнаяВыбраннаяДата > ДобавляемыйПользователь.НачалоПериода Тогда
				МинимальнаяВыбраннаяДата = ДобавляемыйПользователь.НачалоПериода;
			КонецЕсли;
			Если МаксимальнаяВыбраннаяДата = Неопределено Или МаксимальнаяВыбраннаяДата < ДобавляемыйПользователь.ОкончаниеПериода Тогда
				МаксимальнаяВыбраннаяДата = ДобавляемыйПользователь.ОкончаниеПериода;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого УдаляемыйПользователь Из МассивУчастников Цикл
			Если МассивВыбранныеПользователи.Найти(УдаляемыйПользователь.Пользователь) = Неопределено Тогда
				НайденныеСтроки = Объект.CRM_СвоиУчастники.НайтиСтроки(Новый Структура("Участник", УдаляемыйПользователь.Пользователь));
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					Объект.CRM_СвоиУчастники.Удалить(НайденнаяСтрока);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(МинимальнаяВыбраннаяДата) И ЗначениеЗаполнено(МаксимальнаяВыбраннаяДата) Тогда
			Объект.ДатаНачала = МинимальнаяВыбраннаяДата;
			Объект.ДатаОкончания = МаксимальнаяВыбраннаяДата;
			
			ДатаНачалаПриИзменении(Неопределено);
			ДатаОкончанияПриИзменении(Неопределено);
		КонецЕсли;
		
		Модифицированность = Истина;
		ВычислитьОбщееЧислоУчастников();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьПоложениеТумблераСтатусДокумента()
	
	Если Объект.Завершено Тогда
		СтатусДокумента = "Завершено";
	Иначе		
		СтатусДокумента = "ВРаботе";
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруОснованияБизнесПроцесса(Знач ИмяКоманды = Неопределено)
	СтруктураРезультат = Новый Структура("Основание,КартаМаршрута,ИспользоватьВИнтересах", Объект.Ссылка, Объект.CRM_Проект.CRM_КартаМаршрута, Объект.CRM_Проект.CRM_КартаМаршрута.ИспользоватьВИнтересах);
	
	Если ИмяКоманды <> Неопределено Тогда
		Если Найти(ИмяКоманды, "КомандаТочкаСтартаБизнесПроцесса_") > 0 Тогда
			ИдентификаторСсылки = Новый УникальныйИдентификатор(СтрЗаменить(СтрЗаменить(ИмяКоманды, "КомандаТочкаСтартаБизнесПроцесса_", ""), "_", "-"));
			ТочкаМаршрутаСсылка = Справочники.CRM_ТочкиМаршрутов.ПолучитьСсылку(ИдентификаторСсылки);
			Если ЗначениеЗаполнено(ТочкаМаршрутаСсылка) Тогда
				СтруктураРезультат.Вставить("ТочкаСтарта", ТочкаМаршрутаСсылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРезультат;
КонецФункции

&НаСервере
Функция ОбработатьСтартСделки(Сделка)
	
	Если Сделка.Основание = Объект.Ссылка Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ГиперссылкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элемент.Имя = "_ЛичнаяЗадачаСтрокой" Тогда
		ПоказатьЗначение(, ЭтотОбъект._ЛичнаяЗадача);
	ИначеЕсли Элемент.Имя = "_ПоручениеСтрокой" Тогда
		ПоказатьЗначение(, ЭтотОбъект._Поручение);
	ИначеЕсли Элемент.Имя = "_БизнесПроцессСтрокой" Тогда
		ПоказатьЗначение(, ЭтотОбъект._БизнесПроцесс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьПисьмоВыполнить()
	
	СоздатьВзаимодействие("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта");
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьОбщееЧислоУчастников()
	КоличествоУчастников = Объект.ПартнерыИКонтактныеЛица.Количество()+Объект.CRM_СвоиУчастники.Количество();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ПриИзмененииВалютыДокумента();
	ЗаполнитьГруппуГиперссылок();
	//ИспользоватьБизнесПроцессы = Константы.ИспользоватьБизнесПроцессыИЗадачи.Получить();
	ИспользоватьБизнесПроцессы = Константы.CRM_ИспользоватьБизнесПроцессы.Получить();
	ДобавитьУдалитьКомандуСозданияБизнесПроцесса();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	КонецЕсли;
	
	Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("ПлановаяДатаНачала", Метаданные.Справочники.МаркетинговыеМероприятия) Тогда
		Элемент = Элементы.Добавить("ПлановаяДатаНачала", Тип("ПолеФормы"), Элементы.ГруппаПлан);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.ПлановаяДатаНачала";
		Элемент = Элементы.Добавить("ПлановаяДатаОкончания", Тип("ПолеФормы"), Элементы.ГруппаПлан);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.ПлановаяДатаОкончания";
		Элементы.ГруппаФакт.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;	
	
	НастроитьВидимостьИДоступностьФормы(ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.Ответственный.ТолькоПросмотр = Ложь;
		Элементы.Ответственный.КнопкаВыбора = Истина;
	Иначе
		Элементы.Ответственный.ТолькоПросмотр = Истина;
		Элементы.Ответственный.КнопкаВыбора = Ложь;
	КонецЕсли;
	
	УстановитьПоложениеТумблераСтатусДокумента();	
	ВычислитьОбщееЧислоУчастников();
	Элементы.ГруппаВидеофиксация.Видимость = Объект.CRM_ВедетсяВидеофиксация И ПолучитьФункциональнуюОпцию("CRM_ИспользоватьСервисРаспознаванияЛиц");
	Элементы.ГруппаИнформационныеНадписи.Видимость = Объект.CRM_ВедетсяВидеофиксация И ПолучитьФункциональнуюОпцию("CRM_ИспользоватьСервисРаспознаванияЛиц");
	ПроверитьАктивностьВидеофиксации();
	СформироватьПредставлениеВложений();
	// +CRM_Сквозная аналитика
	// ПолучитьДанныеПоФактическимЗатратамНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// CRM_УправлениеДоступом
	МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("CRM_УправлениеДоступомУровниДоступа");
	Если МодульУправлениеДоступом <> Неопределено Тогда
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец CRM_УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьАктивностьВидеофиксации()
	ЗапросНастроек = Новый Запрос;
	ЗапросНастроек.Текст = "ВЫБРАТЬ
	|	АктивныеСеансыВидеофиксацииСрезПоследних.СервисИдентификации КАК СервисИдентификации,
	|	АктивныеСеансыВидеофиксацииСрезПоследних.АктивноеМероприятие КАК АктивноеМероприятие
	|ИЗ
	|	РегистрСведений.CRM_АктивныеСеансыВидеофиксации.СрезПоследних КАК АктивныеСеансыВидеофиксацииСрезПоследних
	|ГДЕ
	|	АктивныеСеансыВидеофиксацииСрезПоследних.СеансЗапущен
	|	И АктивныеСеансыВидеофиксацииСрезПоследних.АктивноеМероприятие = &АктивноеМероприятие";
	ЗапросНастроек.УстановитьПараметр("АктивноеМероприятие", Объект.Ссылка);
	Выборка = ЗапросНастроек.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВидеофиксацияАктивна = Истина;
	Иначе	
		ВидеофиксацияАктивна = Ложь;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновленыДанныеСобытия", Новый Структура("СсылкаНаОбъект, ОбновлятьКалендарь", Объект.Ссылка, Параметры.ОбновлятьКалендарь), ЭтотОбъект);
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект._БизнесПроцесс) Тогда
		
		НовыйБизнесПроцесс = CRM_БизнесПроцессыСервер.ПроверитьНаличиеПроектаСтартоватьБизнесПроцесс(Объект.Ссылка, Объект.CRM_Проект);
		
		Если НЕ НовыйБизнесПроцесс = Неопределено Тогда
			ЗаполнитьГруппуГиперссылок();
			Объект.Завершено			= Истина;
			УстановитьПоложениеТумблераСтатусДокумента();				
			Записать();
			НастроитьВидимостьИДоступностьФормы(ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
	Элементы.Ответственный.ТолькоПросмотр = Истина;
	Элементы.Ответственный.КнопкаВыбора = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		НастроитьОтображениеДатыАктуальности();
		
	Иначе
		
		Элементы.ДатаАктуальности.Заголовок = НСтр("ru='дней ';en='days '");
		
	КонецЕсли;
	Подключаемый_ПомещенияВидеофиксацииПриАктивизацииСтроки();
	
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	Если ТипЗнч(НовыйОбъект) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") ИЛИ ТипЗнч(НовыйОбъект) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
		
		ЗаполнитьГруппуГиперссылок();
		Если ТипЗнч(НовыйОбъект) = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") И НЕ Объект.Завершено Тогда
			УстановитьПоложениеТумблераСтатусДокумента();	
			Объект.Завершено			= Истина;
			Модифицированность	= Истина;
		КонецЕсли;
		НастроитьВидимостьИДоступностьФормы(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	Если ИмяСобытия = "СтартованаСделка" Тогда
		Если ОбработатьСтартСделки(Параметр) Тогда
			ЗаполнитьГруппуГиперссылок();
			
			Если НЕ Объект.Завершено Тогда
				Объект.Завершено			= Истина;
				УстановитьПоложениеТумблераСтатусДокумента();	
				Модифицированность	= Истина;
			КонецЕсли;
			НастроитьВидимостьИДоступностьФормы(ЭтотОбъект);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзменениеСпискаПрисоединенныхФайлов" И Объект.Ссылка = Параметр Тогда
		СформироватьПредставлениеВложений();
		
	ИначеЕсли ИмяСобытия = "Запись_Файл" И (ТипЗнч(Источник) = Тип("СправочникСсылка.МаркетинговыеМероприятияПрисоединенныеФайлы")
		ИЛИ ТипЗнч(Источник) = Тип("Массив") И Источник.Количество()>0 И ТипЗнч(Источник[0]) = Тип("СправочникСсылка.МаркетинговыеМероприятияПрисоединенныеФайлы")) Тогда
		СформироватьПредставлениеВложений();
		
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// +CRM_СквознаяАналитика
	Если Объект.CRM_СквознаяАналитика И Объект.CRM_Неограниченно Тогда
		ПроверкаНеВыполняется = Истина;
	Иначе
		ПроверкаНеВыполняется = Ложь;
	КонецЕсли;
	
	Если НЕ ПроверкаНеВыполняется Тогда
		
		УстановитьПериодДатыАктуальности();
		Если Объект.CRM_ДатаАктуальности < Объект.ДатаОкончания Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Дата окончания должна быть меньше чем Дата начала + Период актуальности.';en='The expiry date should be less than the Date started + the Period of an urgency.'");
			Сообщение.Сообщить(); 
			Отказ = Истина;
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Объект.ДатаОкончания) И (Объект.ДатаОкончания < Объект.ДатаНачала) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Дата окончания не может быть меньше чем Дата начала.';en='The expiry date could not be less than the Date started.'");
			Сообщение.Сообщить(); 
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	// -CRM_СквознаяАналитика
	
	// данные по участникам нам не нужны
	Если НЕ Объект.CRM_СквознаяАналитика Тогда
		СтрОшибки = НСтр("ru='Ошибки заполнения таблицы ""Участники"":';en='Errors of filling of the table ""Participants"":'");
		бОшибки = Ложь;
		МассивОбработанныеСтроки = Новый Массив();
		Для Каждого СтрокаТаблицы Из Объект.CRM_СвоиУчастники Цикл
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Участник) Тогда Продолжить; КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаНачала) И Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрНомерСтроки = Формат(Объект.CRM_СвоиУчастники.Индекс(СтрокаТаблицы) + 1, "ЧН=0; ЧГ=");
			Если	(ЗначениеЗаполнено(СтрокаТаблицы.ДатаНачала) И Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания))
				Или	(ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) И Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаНачала)) Тогда
				//
				СтрОшибки = СтрОшибки + Символы.ПС
				+ НСтр("ru='Строка';en='String'") + " " + СтрНомерСтроки + ": "
				+ НСтр("ru='Дата начала и дата окончания должны быть обе заполнены, или обе не заполнены!';en='The date started and expiry date should be fill both, or both was not fill!'");
				//
				бОшибки = Истина;
				Продолжить;
			КонецЕсли;
			
			Если	(ЗначениеЗаполнено(Объект.ДатаНачала) И СтрокаТаблицы.ДатаНачала < НачалоДня(Объект.ДатаНачала))
				Или	(ЗначениеЗаполнено(Объект.ДатаОкончания) И СтрокаТаблицы.ДатаОкончания > КонецДня(Объект.ДатаОкончания)) Тогда
				//
				СтрОшибки = СтрОшибки + Символы.ПС
				+ НСтр("ru='Строка';en='String'") + " " + СтрНомерСтроки + ": "
				+ НСтр("ru='Выбранный период выходит за границы периода документа!';en='Selected period overstepped the bounds of the period of the document!'");
				//
				бОшибки = Истина;
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаНачала) И ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) И СтрокаТаблицы.ДатаНачала > СтрокаТаблицы.ДатаОкончания Тогда
				СтрОшибки = СтрОшибки + Символы.ПС
				+ НСтр("ru='Строка';en='String'") + " " + СтрНомерСтроки + ": "
				+ НСтр("ru='Дата окончания должна быть больше даты начала!';en='The expiry date should be more date started!'");
				бОшибки = Истина;
				Продолжить;
			КонецЕсли;
			
			Если МассивОбработанныеСтроки.Найти(СтрокаТаблицы) = Неопределено Тогда
				НайденныеСтроки = Объект.CRM_СвоиУчастники.НайтиСтроки(Новый Структура("Участник,ДатаНачала,ДатаОкончания",
				СтрокаТаблицы.Участник, СтрокаТаблицы.ДатаНачала, СтрокаТаблицы.ДатаОкончания));
				//
				Если НайденныеСтроки.Количество() > 1 Тогда
					бОшибки = Истина;
					СтрНомераСтрок = "";
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						МассивОбработанныеСтроки.Добавить(НайденнаяСтрока);
						СтрНомераСтрок = СтрНомераСтрок + ?(ПустаяСтрока(СтрНомераСтрок), "", ",")
						+ Формат(Объект.CRM_СвоиУчастники.Индекс(НайденнаяСтрока) + 1, "ЧН=0; ЧГ=");
						//
					КонецЦикла;
					СтрОшибки = СтрОшибки + Символы.ПС
					+ НСтр("ru='Строки';en='Lines'") + СтрНомераСтрок + ": "
					+ НСтр("ru='Для одного и того же участника периоды не должны повторяться!';en='For the same participant the periods should not repeat!'")
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если бОшибки Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрОшибки,, "Объект.CRM_СвоиУчастники");
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_КомандаНачатьБизнесПроцесс(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда 
		
		ШаблонТекстаВопроса = НСтр("ru='Данные еще не записаны."
"Выполнение действия ""Начать %1"" возможно только после записи данных."
"Данные будут записаны.';en='Data has not been written yet."
"Action execution ""Begin %1"" possible after writing data."
"Data will be written.'");
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаВопроса, ВернутьЗаголовокКоманды(Команда.Имя));
		ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_КомандаНачатьБизнесПроцессПродолжение", ЭтотОбъект, Команда.Имя);	
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		Подключаемый_КомандаНачатьБизнесПроцессПродолжение(Неопределено, Команда.Имя)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаНачатьБизнесПроцессПродолжение(Ответ, КомандаИмя) Экспорт
	
	Если Объект.Ссылка.Пустая() Тогда 
		
		Если Ответ <> КодВозвратаДиалога.ОК Тогда 
			Возврат;
		КонецЕсли;	
		
		Если Не Записать() Тогда 
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	Если ПроверитьДубликатБизнесПроцесса(Объект.Ссылка) Тогда
		ТекстВопроса = НСтр("ru='Уже создан бизнес-процесс."
"Создать новый?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_КомандаНачатьБизнесПроцессЗавершение", ЭтотОбъект, КомандаИмя);	
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	Подключаемый_КомандаНачатьБизнесПроцессЗавершение(Неопределено, КомандаИмя);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаНачатьБизнесПроцессЗавершение(Ответ, КомандаИмя) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	СтруктураОснования = ПолучитьСтруктуруОснованияБизнесПроцесса(КомандаИмя);
	ПараметрыФормы = Новый Структура("Основание", СтруктураОснования);
	ОткрытьФорму("БизнесПроцесс.CRM_БизнесПроцесс.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачу(Команда)
	// +CRM
	CRM_БизнесПроцессыИЗадачиВызовСервера.Выполнить_Задачу(ЭтотОбъект._ЛичнаяЗадача, Истина);
	//БизнесПроцессыИЗадачиВызовСервера.ВыполнитьЗадачу(ЭтотОбъект._ЛичнаяЗадача, Истина);
	// -CRM
	ПоказатьОповещениеПользователя(
	НСтр("ru='Задача выполнена'"),
	ПолучитьНавигационнуюСсылку(ЭтотОбъект._ЛичнаяЗадача),
	Строка(ЭтотОбъект._ЛичнаяЗадача));
	
	Объект.Завершено	= Истина;
	УстановитьПоложениеТумблераСтатусДокумента();		
	Модифицированность	= Истина;
	
	ЗаполнитьГруппуГиперссылок();
	НастроитьВидимостьИДоступностьФормы(ЭтотОбъект);
	
	Оповестить("ЗадачаВыполнена", Новый Структура("ОбновлятьКалендарь", Параметры.ОбновлятьКалендарь));
	
КонецПроцедуры

&НаКлиенте
Процедура Перенаправить(Команда)
	
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	МассивЗадач = Новый Массив;
	МассивЗадач.Добавить(Объект.Ссылка);
	CRM_БизнесПроцессыИЗадачиКлиент.ОбработкаКомандыПеренаправить(МассивЗадач, Новый Структура("Источник",ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодборСвоихУчастников(Команда)
	ПодборУчастников();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСортироватьУчастниковПоВозростанию(Команда)
	Объект.CRM_СвоиУчастники.Сортировать("Участник ВОЗР");
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСортироватьУчастниковПоУбыванию(Команда)
	Объект.CRM_СвоиУчастники.Сортировать("Участник УБЫВ");
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодборКлиентов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", 		  Истина);
	ПараметрыФормы.Вставить("ПрограммноеОткрытие",Истина);		
	
	ОткрытьФорму("Справочник.Партнеры.ФормаВыбора", ПараметрыФормы, Элементы.ПартнерыИКонтактныеЛица);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "ОтборПериод".
//
Процедура ОткрытьСписокИнтересов(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МаркетинговаяКампания", Объект.Ссылка);
	ОткрытьФорму("Справочник.МаркетинговыеМероприятия.Форма.CRM_ФормаСпискаИнтересов", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры // ОткрытьСписокИнтересов()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовУправленияФормы

&НаКлиенте
Процедура CRM_ПроектПриИзменении(Элемент)
	ЗаполнитьГруппуГиперссылок();
	ДобавитьУдалитьКомандуСозданияБизнесПроцесса();
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)
	
	Если СтатусДокумента = "Завершено" Тогда
		Объект.Завершено = Истина
	Иначе		
		Объект.Завершено = Ложь;
	КонецЕсли;	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	СтруктураВалюты = ПолучитьКурсИКратностьВалюты(Объект.CRM_Валюта, Объект.ДатаНачала);
	Объект.CRM_Кратность	= СтруктураВалюты.Кратность;
	Объект.CRM_Курс			= СтруктураВалюты.Курс;
	
	ПриИзмененииВалютыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ПериодАктуальностиПриИзменении(Элемент)
	
	УстановитьПериодДатыАктуальности();
	НастроитьОтображениеДатыАктуальности();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Если Объект.ДатаНачала > Объект.ДатаОкончания Тогда
		Объект.ДатаОкончания = Объект.ДатаНачала;
	КонецЕсли;
	
	УстановитьПериодДатыАктуальности();
	НастроитьОтображениеДатыАктуальности();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	Если Объект.ДатаОкончания < Объект.ДатаНачала Тогда
		Объект.ДатаНачала = Объект.ДатаОкончания;
	КонецЕсли;
	
	УстановитьПериодДатыАктуальности();
	НастроитьОтображениеДатыАктуальности();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСтороннихУчастниковПоРезультатамОтчета(Команда)
	Если Объект.ПартнерыИКонтактныеЛица.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОчисткаСтороннихУчастниковПослеВопроса", ЭтотОбъект, Команда);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Список будет очищен. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		Возврат
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаЗаполнитьСтороннихУчастниковПоРезультатамОтчетаЗавершение", ЭтотОбъект);
	CRM_ОбщегоНазначенияКлиент.ОткрытьФормуЗаполненияПоРезультатамОтчета(ЭтотОбъект, ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСтороннихУчастниковПоРезультатамОтчетаЗавершение(НаименованиеСохраненногоСписка, ДополнительныеПараметры) Экспорт
	
	Если НаименованиеСохраненногоСписка <> Неопределено Тогда
		СохраненныйСписок = CRM_ОбщегоНазначенияСервер.ПолучитьСохраненныйРезультатОтчетаПоНаименованию(НаименованиеСохраненногоСписка);
		Если СохраненныйСписок <> Неопределено Тогда
			ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.Партнеры, СправочникСсылка.КонтактныеЛицаПартнеров");
			Для Каждого СтрокаСписка Из СохраненныйСписок Цикл
				Если ДопустимыеТипы.СодержитТип(ТипЗнч(СтрокаСписка.Значение)) Тогда
					НоваяСтрока = Объект.ПартнерыИКонтактныеЛица.Добавить();
					Если ТипЗнч(СтрокаСписка.Значение) = Тип("СправочникСсылка.Партнеры") Тогда
						НоваяСтрока.Партнер = СтрокаСписка.Значение;
					Иначе
						НоваяСтрока.КонтактноеЛицо = СтрокаСписка.Значение;
						НоваяСтрока.Партнер = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(СтрокаСписка.Значение, "Владелец");
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	ВычислитьОбщееЧислоУчастников();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаСтороннихУчастниковПослеВопроса(Ответ, Команда) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ПартнерыИКонтактныеЛица.Очистить();
		КомандаЗаполнитьСтороннихУчастниковПоРезультатамОтчета(Команда);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияВидеофиксацииПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("Подключаемый_ПомещенияВидеофиксацииПриАктивизацииСтроки", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПомещенияВидеофиксацииПриАктивизацииСтроки()
	ТекСтрока = Элементы.ПомещенияВидеофиксации.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Элементы.КамерыВидеофиксации.ОтборСтрок = Новый ФиксированнаяСтруктура("Помещение", ПредопределенноеЗначение("Справочник.CRM_Помещения.ПустаяСсылка"));
		Элементы.КамерыВидеофиксации.Обновить(); 
	Иначе	
		Элементы.КамерыВидеофиксации.ОтборСтрок = Новый ФиксированнаяСтруктура("Помещение", ТекСтрока.Помещение);
		Элементы.КамерыВидеофиксации.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияВидеофиксацииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПодключитьОбработчикОжидания("Подключаемый_ПомещенияВидеофиксацииПриАктивизацииСтроки", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КамерыВидеофиксацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекСтрока = Элементы.ПомещенияВидеофиксации.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сначала необходимо ВЫБРАТЬ помещение";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КамерыВидеофиксацииПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекСтрока = Элементы.ПомещенияВидеофиксации.ТекущиеДанные;	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда   
		Элемент.ТекущиеДанные.Помещение = ТекСтрока.Помещение;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивКамер()
	Возврат Объект.CRM_КамерыВидеофиксации.Выгрузить().ВыгрузитьКолонку("Камера");
КонецФункции

&НаКлиенте
Процедура КамерыВидеофиксацииКамераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборКамерыОкончание", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ФильтрКамер, ИсключатьСписок", ПолучитьМассивКамер(), Истина);
	Открытьформу("Справочник.CRM_Камеры.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ВыборКамерыОкончание(ДанныеВыбора, ДопПараметры) Экспорт
	Элементы.КамерыВидеофиксации.ТекущиеДанные.Камера = ДанныеВыбора;	
КонецПроцедуры

&НаКлиенте
Процедура CRM_ВедетсяВидеофиксацияПриИзменении(Элемент)
	Элементы.ГруппаВидеофиксация.Видимость = Объект.CRM_ВедетсяВидеофиксация;
	Элементы.ГруппаИнформационныеНадписи.Видимость = Объект.CRM_ВедетсяВидеофиксация;
КонецПроцедуры

&НаСервере
Процедура ДекорацияСтартоватьМероприятиеНажатиеНаСервере()
	Если Объект.Ссылка.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для старта сеанса распознавания лиц необходимо записать документ.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	Если Объект.CRM_УчетнаяЗаписьСервисаРаспознавания.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для старта сеанса распознавания лиц необходимо указать учетную запись сервиса распознавания";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	Набор = РегистрыСведений.CRM_АктивныеСеансыВидеофиксации.СоздатьНаборЗаписей();
	Набор.Очистить();
	Набор.Записать(Истина);
	Запись = Набор.Добавить();
	Запись.Период = ТекущаяДатаСеанса();
	Запись.СервисИдентификации = Объект.CRM_УчетнаяЗаписьСервисаРаспознавания;
	Запись.АктивноеМероприятие = Объект.Ссылка;
	Запись.СеансЗапущен = Истина;
	Набор.Записать(Истина);
	//ПроверитьАктивностьВидеофиксации();
КонецПроцедуры

&НаСервере
Процедура ДекорацияОстановитьРаспознаваниеНажатиеНаСервере()
	Набор = РегистрыСведений.CRM_АктивныеСеансыВидеофиксации.СоздатьНаборЗаписей();
	Набор.Очистить();
	Набор.Записать(Истина);
	//ПроверитьАктивностьВидеофиксации();
КонецПроцедуры

&НаКлиенте
Процедура ВидеофиксацияАктивнаПриИзменении(Элемент)
	Если ВидеофиксацияАктивна Тогда
		ДекорацияСтартоватьМероприятиеНажатиеНаСервере();
	Иначе
		ДекорацияОстановитьРаспознаваниеНажатиеНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАнализСтатистикиПосещенияМероприятияНажатие(Элемент)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "Основной");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ФормаРасшифровки = ПолучитьФорму("Отчет.CRM_АнализСтатистикиПосещенияМероприятия.Форма", ПараметрыФормы);
	ПараметрМероприятие = Новый ПараметрКомпоновкиДанных("Мероприятие");
	Для Каждого Параметр Из ФормаРасшифровки.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если Параметр.Параметр = ПараметрМероприятие Тогда
			Параметр.Использование = Истина;
			Параметр.Значение = Объект.Ссылка;	
		КонецЕсли;	
	КонецЦикла;	
	ФормаРасшифровки.Открыть();
КонецПроцедуры

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

&НаКлиенте
Процедура НеограниченоПриИзменении(Элемент)
	
	Если Объект.CRM_Неограниченно Тогда
		
		Элементы.ДатаОкончания.АвтоОтметкаНезаполненного = Ложь;
		Объект.ДатаОкончания = Дата(1,1,1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЧислоВложений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(МаркетинговыеМероприятияПрисоединенныеФайлы.Ссылка) КАК КоличествоФайлов
	|ИЗ
	|	Справочник.МаркетинговыеМероприятияПрисоединенныеФайлы КАК МаркетинговыеМероприятияПрисоединенныеФайлы
	|ГДЕ
	|	МаркетинговыеМероприятияПрисоединенныеФайлы.ВладелецФайла = &Проект
	|	И НЕ МаркетинговыеМероприятияПрисоединенныеФайлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Проект", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.КоличествоФайлов;
	КонецЕсли;
	
КонецФункции

// Процедура заполняет надпись представление вложений.
//
// Параметры:
//	Нет.
&НаСервере
Процедура СформироватьПредставлениеВложений()
	
	Если Объект.Ссылка.Пустая() Тогда
		ВложенияПредставление = НСтр("ru='Файлы(0)'");
		Элементы.ОткрытьУчастники.Заголовок = НСтр("ru='Участники(0)'");
		Возврат;
	КонецЕсли;
	ВложенияПредставление = "";
	ЧислоВложений = ПолучитьЧислоВложений();
	ВложенияПредставление = НСтр("ru='Файлы('") + ЧислоВложений + ")"; 
	УчастникиКоличество = Объект.ПартнерыИКонтактныеЛица.Количество() + Объект.CRM_СвоиУчастники.Количество();
	Элементы.ОткрытьУчастники.Заголовок = НСтр("ru='Участники('") + УчастникиКоличество + ")";
	
КонецПроцедуры // СформироватьПредставлениеВложений()

&НаКлиенте
Процедура ПроверкаВопросЗаписатьДанныеЗавершение(Ответ, ОписаниеОповещенияОЗавершении) Экспорт
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Записать();
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, Истина);
		Иначе
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, Ложь);
		КонецЕсли;
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаВопросЗаписатьДанные(ОписаниеОповещенияОЗавершении)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаВопросЗаписатьДанныеЗавершение", ЭтотОбъект, ОписаниеОповещенияОЗавершении);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Данные еще не записаны."
"Действие возможно только после записи данных. Записать?'"), 
		РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФайлыЗавершение", ЭтотОбъект);
	ПроверкаВопросЗаписатьДанные(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлыЗавершение(ПродолжитьВыполнение, ПараметрыВыполнения) Экспорт
	
	Если ПродолжитьВыполнение Тогда
		ПараметрыФормы = Новый Структура("ВладелецФайла", Объект.Ссылка);
		ПараметрыФормы.Вставить("ТолькоВложения",	Истина);
		ПараметрыФормы.Вставить("ТолькоПросмотр", ЭтотОбъект.ТолькоПросмотр);
		
		ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
		ПараметрыФормы, ЭтотОбъект, Ложь, Неопределено);
	КонецЕсли;
	
КонецПроцедуры //ОткрытьФайлыЗавершение()

&НаКлиенте
Процедура ОткрытьЗатратыНаРКНажатие(Элемент)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьЗатратПоРКЗавершение", ЭтотОбъект);
	ПроверкаВопросЗаписатьДанные(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗатратПоРКЗавершение(ПродолжитьВыполнение, ПараметрыВыполнения) Экспорт
	
	Если ПродолжитьВыполнение Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("CRM_РекламнаяКампания", Объект.Ссылка);
		ПараметрыФормы = Новый Структура("Отбор", Отбор);
		
		ОткрытьФорму("РегистрСведений.CRM_ЗатратыРекламныхКампаний.ФормаСписка",ПараметрыФормы, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьОбъявленияРекламныхКампанийНажатие(Элемент)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьОбъявленияРекламныхКампанийЗавершение", ЭтотОбъект);
	ПроверкаВопросЗаписатьДанные(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъявленияРекламныхКампанийЗавершение(ПродолжитьВыполнение, ПараметрыВыполнения) Экспорт
	
	Если ПродолжитьВыполнение Тогда
		Отбор = Новый Структура();
		Отбор.Вставить("Владелец", Объект.Ссылка);
		ПараметрыФормы = Новый Структура("Отбор", Отбор);
		
		ОткрытьФорму("Справочник.CRM_ОбъявленияРекламныхКампаний.ФормаСписка",ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры //ОткрытьБизнесПроцессыЗавершение()

&НаКлиенте
Процедура ОткрытьУчастникиНажатие(Элемент)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьУчастникиЗавершение", ЭтотОбъект);
	ПроверкаВопросЗаписатьДанные(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУчастникиЗавершение(ПродолжитьВыполнение, ПараметрыВыполнения) Экспорт
	
	Если ПродолжитьВыполнение Тогда
		ПараметрыФормы = Новый Структура("ПартнерыИКонтактныеЛица,CRM_СвоиУчастники,ДатаНачала,ДатаОкончания", Объект.ПартнерыИКонтактныеЛица,Объект.CRM_СвоиУчастники,Объект.ДатаНачала,Объект.ДатаОкончания);
		ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
		ОткрытьФорму("Справочник.МаркетинговыеМероприятия.Форма.CRM_ФормаУчастники",ПараметрыФормы, ЭтотОбъект,,,,Новый ОписаниеОповещения("УчастникиЗавершениеЗаполнения", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры //ОткрытьУчастникиЗавершение()

&НаСервере
Процедура УчастникиЗавершениеЗаполненияНаСервере(Результат)
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.ПартнерыИКонтактныеЛица.Загрузить(Результат.ПартнерыИКонтактныеЛица.Выгрузить());
		Объект.CRM_СвоиУчастники.Загрузить(Результат.CRM_СвоиУчастники.Выгрузить());
		СформироватьПредставлениеВложений();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчастникиЗавершениеЗаполнения(Результат, Контекст) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		УчастникиЗавершениеЗаполненияНаСервере(Результат)
	КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.Свойства

#КонецОбласти
